# s = "Василенко Николай Геннадьевич"
# count = 0

# s_sp = s.split()

# s = s.replace(' ', '')

# for i in s:
#     if i == s[1]:
#         count += 1


# print(f'Кол-во букв {len(s)}')
# print(f'Кол-во букв, совпадающие со второй буквой фамилии: {count}')
# print(f'Имя - {s_sp[1]}')
# print(f'Кол-во букв в третьем слове: {len(s_sp[2])}')

# Задание 2
s = 'Random text'

print(f'{s.title()}')